app/controllers/reservations_controller.rb

SELECT  "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = ? LIMIT 1  [["id", 1]]
INSERT INTO "reservations" ("party_size", "date_time", "user_id", "restaurant_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["party_size", 4], ["date_time", "2015-07-07 18:14:00.000000"], ["user_id", 1], ["restaurant_id", 1], ["created_at", "2015-07-07 18:14:31.343521"], ["updated_at", "2015-07-07 18:14:31.343521"]]
---
  def create
    @restaurant = Restaurant.find(params[:restaurant_id])

      @reservation = Reservation.new(reservation_params)
      @reservation.user_id = session[:user_id]
      @reservation.restaurant_id = params[:restaurant_id]

    if @reservation.save